IDEA Open Model
SectionStiffnesses Class
Compatible with IDEA StatiCa 20.1
 Section stiffnesses
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.CheckResult.SectionStiffnesses
 Namespace: IdeaRS.OpenModel.Concrete.CheckResult
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class SectionStiffnesses
Public Class SectionStiffnesses
The SectionStiffnesses type exposes the following members.
Constructors
Name | Description
SectionStiffnesses
Initializes a new instance of the SectionStiffnesses class
Top
Properties
Name | Description
Alfa
 rotation around x-axis
EAx
 axial stiffness
EccX
 eccentricity in x-direction
EccY
 eccentricity in y-direction
EccZ
 eccentricity in y-direction
EDyz
 product moment stiffness
EIy
 bending stiffness
EIz
 bending stiffness
GAy
 shear stiffness
GAz
 shear stiffness
GIx
 torsion stiffness
Top
See Also
Reference
IdeaRS.OpenModel.Concrete.CheckResult Namespace